{
  "summary": "The figure illustrates a framework that combines 3D Gaussian modeling with 2D object segmentation using feature resid...",
  "caption": "{An overall illustration of .} Given RGB camera observations collected at different times, we use COLMAP to obtain the camera poses and initial Gaussian points. Then we utilize splatting-based rasterization to render both RGB images and robust features from the environmental Gaussians. We further leverage feature residuals to extract the object masks by mining spatial information of the residuals. Finally, we utilize the ephemerality masks to finetune the 3D Gaussians.",
  "label": "fig:overall",
  "extracted_context": "**Figure Caption:**  \nAn overall illustration of the proposed framework. Given RGB camera observations collected at different times, we first use COLMAP to estimate camera poses and initialize Gaussian points. Next, we employ splatting-based rasterization to render both RGB images and robust features from the environmental Gaussians. By analyzing feature residuals, we mine spatial information to extract object masks. Finally, the ephemerality masks are used to fine-tune the 3D Gaussians, enabling simultaneous 3D environment mapping and 2D object segmentation.  \n\n**Figure Label:**  \n**Fig. 1** (or `fig:overall` as specified).  \n\n---\n\n**Key Notes:**  \n1. **Structure:** The caption follows a logical flow, describing the pipeline from input data to final outputs.  \n2. **Technical Terms:** Terms like \"splatting-based rasterization,\" \"feature residuals,\" and \"ephemerality masks\" are explicitly mentioned to align with the paper's methodology.  \n3. **Clarity:** It avoids markdown and adheres to academic formatting standards, ensuring readability and precision.  \n4. **Consistency:** The label (`fig:overall`) matches the figure's role as an overview of the framework.  \n\nThis format ensures the figure is self-explanatory and aligns with the paper's technical contributions.",
  "extraction_method": "LLM-based"
}