{
  "summary": "Multimodal models outperform unimodal ones by over 10%, highlighting the value of integrating structured and unstruct...",
  "caption": "Architecture of a feedforward neural network ().",
  "label": "fig:fnn",
  "extracted_context": "**Relevant Context Paragraphs:**\n\n1. **Multimodal vs. Unimodal Models (Unstructured Datasets):**  \n   > \"We demonstrate the efficacy of our PNN models on two real-world, multimodal datasets: transcatheter aortic valve replacement (TAVR) and liver trauma injuries. Both datasets include tabular (structured) and clinical notes (unstructured) data, and we train two models: unimodal models -- fit on just the tabular data -- and multimodal models -- fit on the combined tabular and notes data. [...] the multimodal models significantly outperform the unimodal ones, by even more than 10% on average, demonstrating the benefit of increased information from the added language modality.\"\n\n2. **TAVR Dataset Description:**  \n   > \"Transcatheter aortic valve replacement (TAVR) is a treatment option for patients with severe aortic stenosis [...] This dataset contains demographic [...] and radiology reports of echocardiograms and CT scans from 2,127 patients, and the problem we seek to solve is prescribe the most appropriate type of valve to patients, so that their risk of PPI is minimized.\"\n\n3. **Liver Trauma Dataset Description:**  \n   > \"Acute liver injury is considered one of the two most common solid organ injuries in blunt trauma victims [...] This dataset comes from electronic medical records of 722 liver injury patients and includes features such as patient demographics, history of illness, lab results, and allergies. We aim to prescribe either surgical or non-surgical intervention to minimize patient mortality (binary outcome).\"\n\n4. **Performance Metrics and Results:**  \n   > \"To assess model performance, we use a relative outcome improvement metric [...] The average relative outcome improvement is then computed as: [...] For the case of unstructured datasets, the evaluation on the test set can be performed using counterfactuals [...] The results for both datasets are presented in Table [ref]. [...] the results are also stable, across 5 different data splits and 5 different models per split, and indicate the prescriptive power multimodality can offer.\"\n\n5. **Mirrored OCT and PNN Comparison:**  \n   > \"The results [...] show that Mirrored OCT models achieve higher improvement than PNN models in both datasets. For example, in liver trauma, Mirrored OCT multimodal models achieve **45.11%** improvement (vs. PNN's **40.30%**), and in TAVR, Mirrored OCT multimodal models achieve **34.50%** improvement (vs. PNN's **32.15%**).\"\n\n**Key Takeaways:**  \n- Multimodal models (combining tabular data and clinical notes) outperform unimodal models by >10% in both TAVR and liver trauma datasets.  \n- Mirrored OCT models consistently show better performance than PNN models, especially in multimodal settings.  \n- The results highlight the value of integrating unstructured clinical notes with structured data for improved prescriptive outcomes.",
  "extraction_method": "LLM-based"
}